//################################################
// バッテリー(LiPo 2S 7.4V)
//                                      K.Richardo
//################################################
#include "battery.h"

//===============================================
// バッテリ : 初期化
//===============================================
void Batt_ADC_Init( void )
{
    // ADC取得開始
    HAL_ADC_Start( &hadc2 );
}

//===============================================
// バッテリ : 電圧取得
//===============================================
float Batt_Get_V( void )
{
	// ADC(12bit)は3.3Vで4095なので3.3/4095を掛ければ入力電圧の数値
	// 電源電圧は分圧して1/10で入力してるので*10
	HAL_ADC_Start( &hadc2 );						// ADC取得開始
	int value = HAL_ADC_GetValue( &hadc2 );			// 値の取得
	float voltage = 3.3 * value / 4095.0 * 10.0;	// 電圧の計算
	HAL_ADC_Stop( &hadc2 );							// ADC取得停止
	return voltage;

}
