//################################################
// バッテリー(LiPo 2S 7.4V)
//                                      K.Richardo
//################################################
#ifndef MIDDLEWARES_BATTERY_H_
#define MIDDLEWARES_BATTERY_H_

//************************************************
// Include宣言
//************************************************
#include "main.h"

//************************************************
// 関数プロトタイプ宣言
//************************************************
void Batt_ADC_Init( void );
float Batt_Get_V( void );

#endif /* MIDDLEWARES_BATTERY_H_ */
